# ZoneEquipment Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ZoneEquipment Class
Members See Also
---
Represents an early-stage equipment placeholder that provides heating or cooling to part of air system or water loop.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public class ZoneEquipment : Element
```

Visual Basic
---
```text
Public Class ZoneEquipment _
	Inherits Element
```

Visual C++
---
```text
public ref class ZoneEquipment : public Element
```

# Remarks
A zone equipment is different from physical equipment. Depending on its behavior type, it may be mapped to multiple physical equipment later.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Mechanical..::..ZoneEquipment
# See Also
ZoneEquipment Members
Autodesk.Revit.DB.Mechanical Namespace